VPro/src/Catalogs/ProductsAndServicesCategories/ProductsAndServicesCategories.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProductsAndServicesCategories</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>WithoutCategory</name>
      <description>Nhóm sản phẩm chính</description>
    </items>
  </predefined>
  <attributes>
    <name>CharacteristicPropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteImportedAlcoholicProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AlcoholicProductsKind</name>
    <type>
      <types>CatalogRef.AlcoholicProductsKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportedAlcoholicProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCharacteristics</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecificationAttributesArray</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <tabularSections>
    <name>SortingOrder</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/ProductsAndServicesCategories/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - BeforeWrite event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not Cancel And Not IsFolder Then
		
		// StandardSubsystems.Properties
		PropertiesManagement.BeforeObjectKindWrite(ThisObject, "Catalog_Specifications", "SpecificationAttributesArray");
		PropertiesManagement.BeforeObjectKindWrite(ThisObject, "Catalog_ProductsAndServicesCharacteristics", "CharacteristicPropertySet");
		PropertiesManagement.BeforeObjectKindWrite(ThisObject, "Catalog_ProductsAndServices", "PropertySet");
		// End StandardSubsystems.Properties
		
	EndIf;
	
	AdditionalProperties.Insert("IsNew", IsNew());
	
EndProcedure // BeforeWrite()

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If DeletionMark Then
		
		CategoryFillingValue = ProductsAndServicesCategoriesServer.CategoryFillingValue();
		If CategoryFillingValue = Ref Then
			ProductsAndServicesCategoriesServer.WriteCategoryFillingValue(Catalogs.ProductsAndServicesCategories.WithoutCategory);
		EndIf;
		
	EndIf;
	
EndProcedure // OnWrite()

// Procedure - event handler  AtCopy.
//
Procedure OnCopy(CopiedObject)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not IsFolder Then
		PropertySet = Undefined;
		CharacteristicPropertySet = Undefined;
		SortingOrder.Clear();
	EndIf;
	
EndProcedure // OnCopy()

#EndRegion

#EndIf
